import 'package:flutter/material.dart';
import 'package:shayari/shayri2.dart';

class shayari extends StatefulWidget {
  String title;
  shayari(this.title);

  @override
  State<shayari> createState() => _shayariState();
}

class _shayariState extends State<shayari> {
  static List a2 = [
    '''खुशबू की तरह मेरी साँसों में रहना;
               लहू बनके मेरी नस-नस में बहना;
               दोस्ती होती है रिश्तों का अनमोल गहना;
               इसलिए दोस्त को कभी अलविदा न कहना।''',
    '''लोग रूप देखते है ,हम दिल देखते है ,
              लोग सपने देखते है हम हक़ीकत देखते है,
              लोग दुनिया मे दोस्त देखते है,
              हम दोस्तो मे दुनिया देखते है।''',
    '''कहीं अंधेरा तो कहीं शाम होगी,
              मेरी हर ख़ुशी तेरे नाम होगी,
              कभी मांग कर तो देख हमसे ए दोस्त,
              होंठो पर हसीं और हथेली पर जान होगी।''',
    '''हर मोड़ पर मुकाम नहीं होता,
              दिल के रिश्तो का कोई नाम नहीं होता,
              चिराग की रौशनी से ढूँढा है आपको,
              आप जैसा दोस्त मिलना आसान नहीं होता।''',
  ];
  static List a3 = [
    '''आईना देखोगे तो मेरी याद आएगी,
       साथ गुज़री वो मुलाकात याद आएगी,
       पल भर क लिए वक़्त ठहर जाएगा,
       जब आपको मेरी कोई बात याद आएगी.''',
    '''तुम्हारे खयालो से फुरसत नहीं मिलती,
       एक पल के लिए हमें राहत नहीं मिलती,
       यु तो सब कुछ हमारे पास है,
       बस देखने के लिए आप की सूरत नहीं मिलती..!!''',
    '''उसकी मुहब्बत का सिलसिला भी क्या अजीब है,
       अपना भी नहीं बनाती और किसी का होने भी नहीं देती..!!''',
    '''सारी उम्र आँखों में एक सपना याद रहा,
       सदियाँ बीत गयी पर वो लम्हा याद रहा,
       जाने क्या बात थी उसमें और मुझ में,
       सारी महफ़िल भूल गए बस वही एक चेहरा याद रहा..!!'''
  ];
  static List a4 = [
    '''जिंदगी में कठिनाइयां आयें तो उदास ना होना
       क्यूंकि कठिन रोल अच्छे एक्टर को ही दिए जाते हैं''',
    '''कठिन समय में अपनी उम्मीदें न खोना, 
       जल्द ही एक नई सुबह आपके जीवन को नयी चमक देगी।''',
    '''यूँ तो आसान नहीं है ख्वाब टूटने पर नये ख्वाबों को सजाना,
       पर इतना कठिन भी नहीं है जीवन की चुनौतियों के सामने मुस्कुराना''',
    '''जीवन में कठिनाइयाँ जितनी भी हो,
       आपके पास जो भी है उनमे खुशियाँ ढूंढो!''',
    '''शाम को थक कर टूटे झोपड़े में सो जाता है
       वो मजदूर,
       जो शहर में ऊंची इमारतें बनाता है''',
  ];
  static List a5 = [
    '''कभी कभी ये क्यों लगता है,
       कि तुम मेरी पूरी ज़िन्दगी हो।
       और मैं तुम्हारा लम्हा भी नहीं।''',
    '''सबसे ज्यादा दर्द तब होता है 
       जब हम अपना दर्द किसी को 
       बता नहीं पाते।''',
    '''किताबों के अलावा जो चीज सबक देती है,
       उसका नाम ज़िन्दगी है।''',
    '''दर्द तो रोज का तमाशा है,
       आज तो सदीद है साईं।''',
    '''कभी तोडा कभी जोड़ा कभी फिर तोड़कर जोड़ा,
       नाकारा कर दिए दिल को तेरी पेवन्द कारी ने।''',
  ];
  static List a6 = [
    '''कोई चाहे कितना भी बड़ा हो, कामयाबी खुद से ही मिलती हे,
       सागर चाहे कितना भी बड़ा हो, प्यास नदी के पानी से ही मिटती है।''',
    '''ज़िन्दगी में कभी ख़ुशी कभी गम आते हे, लेकिन उससे भी मज़बूत मेरे इरादे हे,
       ज़िन्दगी से जो लोग हार जाते हे, वो कभी कामयाब नहीं हो पाते हे।''',
    '''बस्ता उठा के काम करने चले कुछ बड़े, अपने छोटे कदमो को करने चले कुछ बड़े,
       कामयाबी तो परिश्रम की धुल है जनाब, उस कामयाबी से करने चले अपने हर शोक पुरे।''',
    '''हर उस शख्स की ज़ुबान बंद करनी हे,
          जिन्होंने कहा था तुमसे नहीं होगा।
       मुझसे जलने वालो, जरा एक बात सुनो,
          अभी कामयाब देखना बाकि हे, कही मर मत जाना।''',
    '''सफलता यूँ ही नहीं मिलती लेनी पड़ती हे,
       मेहनत के आगे झुकना और लोगो से लड़ना पड़ता हे,
       यूँ बैठे रहोगे तो नाकामयाबी ही हाथ आएगी,
       कामयाबी पानी हे तो उठना भी पड़ता हे।''',
  ];
  static List a7 = [
    '''आहटें सुन रहा हूँ यादों की
       आज भी अपने इंतज़ार में ग़ुम''',
    '''आने में सदा देर लगाते ही रहे तुम
       जाते रहे हम जान से, आते ही रहे तुम''',
    '''अब इन हुदूद में लाया है इंतज़ार मुझे
       वो आ भी जाएँ तो आए न ऐतबार मुझे''',
    '''इक रात वो गया था जहाँ बात रोक के 
       अब तक रुका हुआ हूँ वहीं रात रोक के ''',
    '''अब ख़ाक उड़ रही है यहाँ इंतज़ार की
       ऐ दिल ये बाम-ओ-दर किसी जान-ए-जहाँ के थे''',
    '''जिस की आँखों में कटी थीं सदियाँ 
       उस ने सदियों की जुदाई दी है ''',
  ];
  static List a8 = [
    '''कोई चाहे कितना भी बड़ा हो, कामयाबी खुद से ही मिलती हे,
       सागर चाहे कितना भी बड़ा हो, प्यास नदी के पानी से ही मिटती है।''',
    '''ज़िन्दगी में कभी ख़ुशी कभी गम आते हे, लेकिन उससे भी मज़बूत मेरे इरादे हे,
       ज़िन्दगी से जो लोग हार जाते हे, वो कभी कामयाब नहीं हो पाते हे।''',
    '''बस्ता उठा के काम करने चले कुछ बड़े, अपने छोटे कदमो को करने चले कुछ बड़े,
       कामयाबी तो परिश्रम की धुल है जनाब, उस कामयाबी से करने चले अपने हर शोक पुरे।''',
    '''हर उस शख्स की ज़ुबान बंद करनी हे,
          जिन्होंने कहा था तुमसे नहीं होगा।
       मुझसे जलने वालो, जरा एक बात सुनो,
          अभी कामयाब देखना बाकि हे, कही मर मत जाना।''',
    '''सफलता यूँ ही नहीं मिलती लेनी पड़ती हे,
       मेहनत के आगे झुकना और लोगो से लड़ना पड़ता हे,
       यूँ बैठे रहोगे तो नाकामयाबी ही हाथ आएगी,
       कामयाबी पानी हे तो उठना भी पड़ता हे।''',
  ];
  static List a9 = [
    '''जिंदगी में कठिनाइयां आयें तो उदास ना होना
       क्यूंकि कठिन रोल अच्छे एक्टर को ही दिए जाते हैं''',
    '''कठिन समय में अपनी उम्मीदें न खोना, 
       जल्द ही एक नई सुबह आपके जीवन को नयी चमक देगी।''',
    '''यूँ तो आसान नहीं है ख्वाब टूटने पर नये ख्वाबों को सजाना,
       पर इतना कठिन भी नहीं है जीवन की चुनौतियों के सामने मुस्कुराना''',
    '''जीवन में कठिनाइयाँ जितनी भी हो,
       आपके पास जो भी है उनमे खुशियाँ ढूंढो!''',
    '''शाम को थक कर टूटे झोपड़े में सो जाता है
       वो मजदूर,
       जो शहर में ऊंची इमारतें बनाता है''',
  ];
  static List a10 = [
    '''खुशबू की तरह मेरी साँसों में रहना;
               लहू बनके मेरी नस-नस में बहना;
               दोस्ती होती है रिश्तों का अनमोल गहना;
               इसलिए दोस्त को कभी अलविदा न कहना।''',
    '''लोग रूप देखते है ,हम दिल देखते है ,
              लोग सपने देखते है हम हक़ीकत देखते है,
              लोग दुनिया मे दोस्त देखते है,
              हम दोस्तो मे दुनिया देखते है।''',
    '''कहीं अंधेरा तो कहीं शाम होगी,
              मेरी हर ख़ुशी तेरे नाम होगी,
              कभी मांग कर तो देख हमसे ए दोस्त,
              होंठो पर हसीं और हथेली पर जान होगी।''',
    '''हर मोड़ पर मुकाम नहीं होता,
              दिल के रिश्तो का कोई नाम नहीं होता,
              चिराग की रौशनी से ढूँढा है आपको,
              आप जैसा दोस्त मिलना आसान नहीं होता।''',
  ];
  static List a11 = [
    '''आहटें सुन रहा हूँ यादों की
       आज भी अपने इंतज़ार में ग़ुम''',
    '''आने में सदा देर लगाते ही रहे तुम
       जाते रहे हम जान से, आते ही रहे तुम''',
    '''अब इन हुदूद में लाया है इंतज़ार मुझे
       वो आ भी जाएँ तो आए न ऐतबार मुझे''',
    '''इक रात वो गया था जहाँ बात रोक के 
       अब तक रुका हुआ हूँ वहीं रात रोक के ''',
    '''अब ख़ाक उड़ रही है यहाँ इंतज़ार की
       ऐ दिल ये बाम-ओ-दर किसी जान-ए-जहाँ के थे''',
    '''जिस की आँखों में कटी थीं सदियाँ 
       उस ने सदियों की जुदाई दी है ''',
  ];
  static List i1 = ["image1.jpg", "image1.jpg", "image1.jpg", "image1.jpg"];
  static List i2 = ["image2.jpg", "image2.jpg", "image2.jpg", "image2.jpg"];
  static List i3 = [
    "image3.jpg",
    "image3.jpg",
    "image3.jpg",
    "image3.jpg",
    "image3.jpg"
  ];
  static List i4 = [
    "image4.jpg",
    "image4.jpg",
    "image4.jpg",
    "image4.jpg",
    "image4.jpg"
  ];
  static List i5 = [
    "image5.jpg",
    "image5.jpg",
    "image5.jpg",
    "image5.jpg",
    "image5.jpg"
  ];
  static List i6 = [
    "image6.png",
    "image6.png",
    "image6.png",
    "image6.png",
    "image6.png",
    "image6.png"
  ];

  static List emo = [
    "😊 😇 🥰 😍 🤩 😘",
    "😊 😇 🥰 😍 🤩 😘",
    "😊 😇 🥰 😍 🤩 😘",
    "😊 😇 🥰 😍 🤩 😘",
    "😊 😇 🥰 😍 🤩 😘",
    "😊 😇 🥰 😍 🤩 😘"
  ];
  @override
  List s = [];
  List s1 = [];
  void initState() {
    if (widget.title == "प्यार शायरी") {
      s = a3;
      s1 = i1;
    } else if (widget.title == "दोस्ती शायरी") {
      s = a2;
      s1 = i2;
    } else if (widget.title == "जीवन जिंदगानी शायरी") {
      s = a4;
      s1 = i3;
    } else if (widget.title == "दर्द भरी शायरी") {
      s = a5;
      s1 = i4;
    } else if (widget.title == "कामयाबी शायरी") {
      s = a6;
      s1 = i5;
    } else if (widget.title == "इंतज़ार शायरी") {
      s = a7;
      s1 = i6;
    } else if (widget.title == "रोमांटिक शायरी") {
      s = a8;
      s1 = i6;
    } else if (widget.title == "मजेदार शायरी") {
      s = a9;
      s1 = i6;
    } else if (widget.title == "शुभ रात्रि शायरी") {
      s = a10;
      s1 = i6;
    } else if (widget.title == "गोलमाल शायरी") {
      s = a11;
      s1 = i6;
    } else if (widget.title == "गुड मॉर्निंग शायरी") {
      s = a7;
      s1 = i6;
    }
    // TODO: implement initState
    super.initState();
  }

  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(widget.title, style: TextStyle(color: Colors.white)),
        centerTitle: true,
        backgroundColor: Colors.black,
      ),
      backgroundColor: Colors.black,
      body: ListView.separated(
        itemCount: s.length,
        itemBuilder: (context, index) {
          return ListTile(
            onTap: () {
              Navigator.push(context, MaterialPageRoute(
                builder: (context) {
                  return shayari1(s, index);
                },
              ));
            },
            title: Text(
              "${emo[index]},${s[index].toString().substring(0, 18)}",
              style: TextStyle(color: Colors.white),
            ),
            leading:
                CircleAvatar(backgroundImage: AssetImage("image/${s1[index]}")),
            trailing: Icon(
              Icons.chevron_right,
              color: Colors.amber,
            ),
            tileColor: Colors.grey,
          );
        },
        separatorBuilder: (BuildContext context, int index) {
          return Divider(
            height: 5,
            thickness: 5,
          );
        },
      ),
    );
  }
}
